; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	spectrograph4 - mode
	infrared5 - mode
	thermograph6 - mode
	infrared1 - mode
	thermograph8 - mode
	spectrograph0 - mode
	image2 - mode
	spectrograph3 - mode
	image7 - mode
	GroundStation5 - direction
	Star6 - direction
	Star2 - direction
	GroundStation3 - direction
	Star0 - direction
	GroundStation1 - direction
	Star4 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(supports instrument0 infrared5)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 Star2)
	(supports instrument1 thermograph6)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star0)
	(supports instrument2 image7)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument3 thermograph6)
	(supports instrument3 image2)
	(supports instrument3 spectrograph3)
	(calibration_target instrument3 Star4)
	(supports instrument4 spectrograph4)
	(supports instrument4 infrared1)
	(supports instrument4 spectrograph0)
	(supports instrument4 thermograph8)
	(calibration_target instrument4 Star4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
)
(:goal (and
	(pointing satellite1 Phenomenon8)
	(have_image Star7 infrared5)
	(have_image Star7 thermograph8)
	(have_image Star7 spectrograph4)
	(have_image Phenomenon8 thermograph8)
	(have_image Phenomenon8 infrared5)
	(have_image Star9 spectrograph4)
	(have_image Star9 image2)
	(have_image Star9 infrared1)
	(have_image Phenomenon10 image7)
	(have_image Planet11 spectrograph4)
	(have_image Planet11 thermograph8)
	(have_image Planet12 infrared5)
))

)

; plan
1. (turn_to satellite1 star4 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star4)
   goals met: 0 of 13
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 13
3. (calibrate satellite1 instrument3 star4)
   added: (calibrated instrument3)
   goals met: 0 of 13
4. (turn_to satellite1 star9 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 star9)
   goals met: 0 of 13
5. (turn_to satellite0 groundstation1 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 13
6. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 13
7. (calibrate satellite0 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 0 of 13
8. (turn_to satellite0 phenomenon10 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon10)
   goals met: 0 of 13
9. (take_image satellite0 phenomenon10 instrument2 image7)
   added: (have_image phenomenon10 image7)
   goals met: 1 of 13
10. (turn_to satellite0 groundstation3 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 groundstation3)
   goals met: 1 of 13
11. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 1 of 13
12. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 13
13. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 1 of 13
14. (take_image satellite1 star9 instrument3 image2)
   added: (have_image star9 image2)
   goals met: 2 of 13
15. (switch_off instrument3 satellite1)
   deleted: (power_on instrument3)
   added: (power_avail satellite1)
   goals met: 2 of 13
16. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 2 of 13
17. (turn_to satellite0 phenomenon8 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon8)
   goals met: 2 of 13
18. (take_image satellite0 phenomenon8 instrument0 infrared5)
   added: (have_image phenomenon8 infrared5)
   goals met: 3 of 13
19. (turn_to satellite0 planet12 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet12)
   goals met: 3 of 13
20. (take_image satellite0 planet12 instrument0 infrared5)
   added: (have_image planet12 infrared5)
   goals met: 4 of 13
21. (turn_to satellite0 star7 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star7)
   goals met: 4 of 13
22. (take_image satellite0 star7 instrument0 infrared5)
   added: (have_image star7 infrared5)
   goals met: 5 of 13
23. (take_image satellite0 star7 instrument0 spectrograph4)
   added: (have_image star7 spectrograph4)
   goals met: 6 of 13
24. (turn_to satellite1 star4 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star4)
   goals met: 6 of 13
25. (calibrate satellite1 instrument4 star4)
   added: (calibrated instrument4)
   goals met: 6 of 13
26. (turn_to satellite1 planet11 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 planet11)
   goals met: 6 of 13
27. (take_image satellite1 planet11 instrument4 spectrograph4)
   added: (have_image planet11 spectrograph4)
   goals met: 7 of 13
28. (take_image satellite1 planet11 instrument4 thermograph8)
   added: (have_image planet11 thermograph8)
   goals met: 8 of 13
29. (turn_to satellite1 star7 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 star7)
   goals met: 8 of 13
30. (take_image satellite1 star7 instrument4 thermograph8)
   added: (have_image star7 thermograph8)
   goals met: 9 of 13
31. (turn_to satellite1 star9 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star9)
   goals met: 9 of 13
32. (take_image satellite1 star9 instrument4 infrared1)
   added: (have_image star9 infrared1)
   goals met: 10 of 13
33. (take_image satellite1 star9 instrument4 spectrograph4)
   added: (have_image star9 spectrograph4)
   goals met: 11 of 13
34. (turn_to satellite1 phenomenon8 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 phenomenon8)
   goals met: 12 of 13
35. (take_image satellite1 phenomenon8 instrument4 thermograph8)
   added: (have_image phenomenon8 thermograph8)
   goals met: 13 of 13
